
-
----
-all
-and
-as
-i
-in
-not
-now
-rangers
-ring
-uncanny
102
1070
111
1147
1158-60
130
1311
1341
1342
1401
1403
1417
1418
1419
1420
1420-1
1421
1462
1592
172
2
20th
22nd
3
33
37
4
5
64
80
a
a-cutting
a-glimmer
a-going
a-hammering
a-hunting
a-lalla-lalla-rumba-kamanda-lind-or-burume
a-letting
a-lyin
a-meddling
a-purpose
a-thinking
a-waylaying
aback
abandon
abandoned
abandons
abashed
abate
abated
abbreviated
abed
abide
abiding
ablaze
able
aboard
abode
abominable
about
above
abreast
abroad
abrupt
absence
absolute
abstracts
absurd
absurdly
abundant
abundantly
abuse
abyss
accents
accept
accepted
accepting
accident
accomplish
accomplished
accord
accorded
according
account
accounted
accounting
accounts
accurate
accursed
accused
accusing
accustomed
ach
ache
ached
aches
achieve
achieved
achieving
aching
acknowledge
acknowledged
acorn
acquaintance
acquainted
acquire
acquired
acres
acrobatics
across
act
acted
actual
actually
adamant
add
added
adders
adding
addition
additional
additions
address
addressed
addressing
adelard
adjoining
adjusted
admirable
admiration
admire
admirers
admiring
admit
admittance
admitted
adopt
adopted
adoption
adrift
advance
advanced
advancing
advantage
adventure
adventures
adventurous
advice
advise
advised
aear
aearon
afar
affair
affairs
affect
affection
affinity
afflicted
afford
affray
afield
afire
aflame
afloat
afoot
afore
aforetime
afraid
afresh
after
after-days
after-dinner
afternoon
afternoons
afterthought
afterward
afterwards
again
against
against---
against-well
age
age-long
age-old
age-worn
aged
ageing
ageless
agelong
ages
aggrieved
agh
aghast
agility
agin
agitation
aglar
aglarni
aglarond
ago
ago-now
agony
agree
agreed
agreement
agricultural
ah
ahead
ai
ai-menu
ai-oi
aid
aided
aiding
aiglos
ail
ailing
aim
aimed
aimlessly
aint
air
air-movements
airetari-lirinen
airless
airs
airy
aisle
aisles
aiya
ajar
akin
aknown
alarm
alarmed
alarming
alas
alcove
alcoves
aldalome
aldaron
alder
alder-trees
aldor
ale
alert
alfirin
alien
alight
alighted
alike
alive
all
allay
allegiance
alley
alleys
alliance
alliances
allied
allies
allotted
allow
allowance
allowed
allows
alls
allude
allured
almost
aloft
alone
along
alongside
aloof
aloud
already
already-before
already-they
also
alter
altered
altering
alternated
alternative
although
altogether
always
am
amaze
amazed
amazement
amazing
ambar-metta
ambarona
ambassador
ambassadors
amble
ambush
ambushed
ambushing
amend
amended
amends
amethyst
amid
amidmost
amidst
amiss
ammen
amon
among
amongst
amount
amroth
amroths
amuse
amused
amusement
amusing
an
anann
anarion
anborn
ancalagon
ancalima
ancestral
anchored
ancient
ancientry
and
and-
andave
andros
anduin
andune
anduril
andy
anemones
anew
anfalas
angband
angbor
angelicas
anger
angered
angers
angle
angmar
angren
angrenost
angrier
angrily
angry
anguish
anigh
animal
animals
ankle
ankle-deep
ankles
ann-thennath
annals
annexed
anniversary
annon
annotation
announce
announced
announcement
annoyance
annoyed
annuminas
annun
anon
anor
anorien
another
anothers
answer
answerable
answered
answering
answers
ant-hill
anthills
antiquity
ants
anvil
anvils
anxiety
anxious
anxiously
any
anybody
anybodys
anyhow
anyone
anything
anyway
anywhere
apace
apart
ape
apes
apiece
apologetically
apparent
apparently
appealingly
appear
appearance
appearances
appeared
appearing
appears
appease
appended
appetite
applauding
applause
apple
apple-wood
appledore
apples
apply
appoint
appointed
approach
approached
approaches
approaching
approval
approved
approving
april
apron
apt
aput
ar
aragorn
aragorns
aranion
arathorn
araw
arc
arch
arched
archers
archery
arches
archet
archway
are
are-and
arent
argent
argonath
argue
argued
arguing
argument
arguments
arid
aright
arise
arisen
arises
arising
arm
armed
armies
armour
armoured
armourer
armouries
armoury
armpit
armpits
arms
army
arnach
arnen
arnor
arod
arods
aromatic
arose
around
arouse
aroused
arrange
arrange-here
arranged
arrangement
arrangements
array
arrayed
arrest
arrested
arrival
arrive
arrived
arriving
arrow
arrow-feathers
arrow-point
arrows
art
article
articles
arts
arvedui
arvernien
arwen
as
ascend
ascending
ascent
asea
asfaloth
ash
ash-grey
ash-heaps
ash-ridden
ash-staff
ash-trees
ashamed
ashen
ashen-cold
ashen-grey
ashes
ashore
aside
ask
asked
asking
asks
asleep
asphodel
ass
assail
assailed
assailing
assault
assaulting
assemble
assembled
assembling
assembly
assented
assigned
assistance
assistant
assisting
assortment
assuaged
assure
assured
assuredly
astir
astonished
astonishing
astonishment
astounding
astray
astray-if
asunder
at
ate
athelas
atone
atop
attached
attack
attacked
attacker
attacking
attempt
attempted
attend
attended
attends
attention
attentive
attentively
attire
attired
attracted
attractions
attributed
auction
audibly
audience
aught
authorities
authority
autumn
autumn-cleaning
autumns
avail
available
availed
avalanche
avalanches
avanier
avenge
avenged
avenging
avenue
avenues
aver
averted
avoid
avoided
avoiding
await
awaited
awaiting
awaits
awake
awaken
awakened
awakening
awakes
aware
away
away-and
awe
awhile
awkward
awkwardly
awoke
axe
axe-bearer
axe-haft
axe-heads
axe-hewn
axe-men
axe-stroke
axes
axin
ay
aye
azanulbizar
b
babbled
babbling
babel
bachelors
back
backarappers
backed
background
backs
backward
backwards
backwards-like
bacon
bad
bade
badge
badger
badgering
badgers
badges
badly
badness
baffle
baffled
bag
baggage
baggage-carrier
baggage-pony
baggins
bagginses
bagronk
bags
bagshot
bain
bait
baked
bakers
balance
balanced
balcony
bald
baldor
baldric
baleful
balin
balins
ball
ballast
balrog
balrogs
balusters
bamfurlong
band
bandage
bandobras
bands
bandy
bane
bang
banging
banished
bank
banked
banks
banner
banner-bearer
banners
banquet
banquets
bar
barad-dur
barahir
baran
baranduin
baranor
baraz
barazinbar
barbed
barbs
bard
bardings
bare
bare-back
bared
barely
barer
barest
bargain
bargain-if
bargain-prices
bargained
bargains
barges
baring
bark
barked
barking
barley
barliman
barn
barns
barred
barrel
barrels
barren
barricade
barrier
barriers
barring
barrow
barrow-blade
barrow-downs
barrow-top
barrow-wight
barrow-wightish
barrow-wights
barrowfield
barrows
bars
baruk
base
bases
basin
basins
basket
basking
bastards
bastion
bastions
bath
bath-songs
bath-water
bathe
bathed
bathing
bathroom
baths
bats
battalions
battered
battering
battle
battle-axes
battle-cries
battle-field
battle-fury
battlement
battlemented
battlements
battles
bay
bay-leaves
bay-trees
baying
bb
be
be-unless
be-yes
beaches
beacon
beacons
bead
beads
beak
beaklike
beam
beaming
beams
beans
bear
bearable
beard
bearded
beardless
beards
bearer
bearers
bearing
bears
beast
beast-fell
beast-flesh
beast-shape
beastly
beasts
beat
beaten
beater
beating
beats
beautiful
beautifuller
beautifully
beauty
beaver
became
because
beckon
beckoned
beckoning
become
becomes
becoming
bed
bed-loft
bed-song
bedewed
bedridden
bedroom
bedrooms
beds
bedside
bee-hunter
beech
beech-grove
beech-tree
beech-trees
beech-woods
beechbone
beechen
beeches
been
beer
beer-barrel
beers
bees
beetles
befall
befallen
befell
befit
before
before-it
beforehand
befriend
befriended
beg
began
beggar
beggar-like
beggar-man
beggars
begged
begging
begin
beginning
beginnings
begins
begone
begotten
begrudged
begs
begun
behalf
behave
behaved
behaving
behaviour
beheaded
beheld
behind
behold
being
belated
belch
belched
belching
beleaguered
beleriand
belfalas
belie
belied
belief
believe
believed
believes
believing
belike
bell
bell-chain
bell-stems
bellies
bellow
bellowed
bellowing
bellows
bells
belly
bellying
bellys
belong
belonged
belonging
belongings
belongs
beloved
below
belt
belted
belts
bemused
ben-adar
bench
benches
bend
bendable
bending
bends
beneath
benefit
benefits
benevolent
bent
beorn
beornings
bereaved
bereft
beregond
beregonds
beren
bergil
bergils
berhael
berries
berry
berry-o
berth
beruthiel
beryl
beset
beside
besides
besieged
besiegers
besom
best
best-fed
bestial
bestirred
bestow
bestowed
bet
beth
betide
betray
betrayal
betrayals
betrayed
better
betters
between
beware
bewilder
bewildered
bewildering
bewilderment
bewitched
bewitchment
beyond
bickering
bid
bidden
bidding
bide
biding
bids
bier
biers
bifur
big
bigger
biggest
bight
bilberry
bilbo
bilbos
bill
billowing
billows
bind
binding
binds
birch
birches
bird
bird-call
bird-like
bird-tamer
birdlike
birds
birds-nesting
birth
birthday
birthday-parties
birthday-party
birthday-presents
birthdays
bit
bite
biter
bites
biting
bits
bitten
bitter
bitter-sweet
bitterly
bitterness
bivouac
bivouacked
black
black-boned
black-edged
black-feathered
black-greys
black-handed
black-harnessed
black-helmed
black-leather
black-like
black-mantled
black-skinned
black-winged
blackberry
blackened
blacker
blackhanded
blackness
blackroot
blacksmiths
blade
blades
blame
blamed
blameless
blames
blanch
blanched
blanco
blank
blanket
blankets
blankly
blare
blared
blaring
blast
blasted
blasting
blasts
blaze
blazed
blazing
blazoned
bleak
bleared
bleary
bleating
bleeding
blemish
blench
blenched
blended
blending
bless
blessed
blessedly
blessedness
blessing
blessings
blest
blew
blight
blind
blinded
blindfold
blindfolded
blinding
blindly
blindness
blink
blinked
blinking
bliss
blissful
blistered
blizzard
bloated
block
blocked
blocking
blocks
blood
blood-red
bloodshot
bloodthirsty
bloody-handed
bloom
blossom
blossomed
blossoming
blot
blotch
blotched
blotted
blotting
blow
blowing
blown
blows
blue
blue-gleaming
blue-grey
blue-shadowed
blunder
blundering
blunted
blunting
blur
blurred
blurring
blush
blushed
blushing
boar
board
boarded
boards
boast
boasted
boat
boat-bridges
boating
boats
bob
bobbed
bobbing
bobs
bode
bodies
bodiless
boding
body
boffin
boffins
bofur
bog
bogey-stories
boggy
bogs
boil
boiled
boiling
boils
bold
bold-at
bolder
boldest
boldly
boldness
bole
boles
bolger
bolgers
bollards
bolster
bolsters
bolt
bolted
bolting
bolts
bom
bombadil
bombadillo
bombadils
bombur
bond
bonds
bone
bone-thin
bone-white
boned
boner
bones
bonfire
bony
book
book-case
book-learned
books
boom
boomed
booming
booms
boon
boorar
boot
booted
booth
booths
bootless
boots
booty
border
border-land
border-war
bordered
borders
bore
bored
borgil
boring
born
borne
boro
boromir
boromirs
borrow
borrower
bosom
boss
bosses
bosss
botanical
both
bother
bothered
bothering
bottle
bottled
bottles
bottles-last
bottom
bough
boughs
bought
boulder
boulders
bound
boundary
bounded
bounders
bounding
bounds
bow
bow-legged
bowed
bower
bowing
bowl
bowl-shaped
bowlegged
bowls
bowman
bowmen
bows
bowshot
bowstring
bowstrings
box
box-wood
box-woods
boxes
boy
boys
brace
braced
bracegirdle
bracegirdles
bracelet
bracken
brackets
brag
braided
braids
brain
brake
brakes
bramble
brambles
branch
branched
branches
branching
brand
branded
brandir
brandished
brandishing
brandmarks
brands
brandy
brandybuck
brandybucks
brandywine
brat
brats
brave
braver
braying
brazen
brazen-throated
brazier
breach
breached
breaches
bread
bread-crust
breadth
break
breaker
breakfast
breakfasted
breakfasts
breaking
breaks
breast
breast-high
breastwork
breath
breathe
breathed
breathing
breathless
breathlessly
breathlessness
breaths
bred
bree
bree-and
bree-blood
bree-dialect
bree-folk
bree-hill
bree-hobbits
bree-land
bree-lander
bree-landers
bree-men
breeches
breeches-pocket
breed
breeds
breek-neek
breeland
breelanders
breeze
breezy
bregalad
brego
brethren
brew
brewing
briar
briar-thickets
briars
bribing
brick
bricks
bride-price
bridge
bridge-end
bridge-house
bridged
bridgefields
bridges
bridle
bridled
brief
briefer
briefly
brigand
brigands
bright
bright-burnished
bright-eyed
brightened
brighter
brightest
brightly
brightness
brim
brimming
bring
bringer
bringing
brings
brink
brisk
briskly
bristles
bristling
brm
broached
broad
broad-bladed
broad-headed
broadened
broadening
broadens
broader
brockenbores
brockhouse
brockhouses
broidered
broil
broke
broken
brokenly
bronze
brooch
brooches
brood
brooded
brooding
broods
brook
brooks
broom
broth
brother
brothers
brought
brow
brown
brown-green
brown-haired
brown-skinned
browned
browner
browns
brows
brr
bruinen
bruise
bruised
bruising
brunt
brush
brush-
brushed
brushing
brushwood
brutal
brute
brutes
bubble
bubbled
bubbling
bubhosh
buch
buck
buck-land
buckland
bucklander
bucklanders
bucklebury
buckler
bucklers
bucks
bud
budding
budge
budgeford
buds
build
builded
builder
builders
building
buildings
built
bulged
bulging
bulk
bulky
bull
bullies
bullroarer
bullying
bulwark
bump
bumped
bumping
bumpkin
bunched
bundle
bundled
bundles
bundushathur
burarum
burden
burdened
burdens
burdensome
burg
burg-wall
burial
buried
burn
burned
burning
burnings
burnished
burns
burrow
burrowed
burrowing
burrows
burrowses
burst
bursting
bursts
bury
burying
burzum-ishi
bush
bush-shrouded
bushes
bushy
busied
busier
busily
business
bustle
bustling
busy
busybody
but
but-he
but-well
butt
butt-end
butter
butterbur
butterburs
butterflies
butteries
buttery
buttons
buttress
buttresses
buy
buyer
buzzed
buzzing
by
bye
bygone
byre
byres
bywater
byways
byword
cabbages
cackle
cackled
cage
caged
caging
cair
cairn
caita
cake
caked
cakes
calacirian
calacirya
calaciryo
calculate
calculations
calembel
calenardhon
calendar
calendars
calenhad
call
called
callers
calling
calls
calm
calmed
calmer
calmly
came
camp
camp-cooking
camp-fire
campaigner
camped
camping
camping-ground
camping-place
camping-places
campment
camps
can
candle
candlelight
candles
canker
cannot
canopied
canopy
cans
cant
cap
capable
caper
capered
capering
caperings
capital
capitals
capped
caps
captain
captain-general
captains
captive
captives
captivity
captors
capture
captured
carach
caradhras
caras
carcanet
carcase
carcases
carchost
card
care
cared
career
careering
careful
carefully
careless
carelessly
cares
caress
caressed
caressing
careworn
cargo
caring
carn
carnimirie
carpenter
carpeted
carriages
carried
carrier
carriers
carries
carrion
carrion-beasts
carrion-birds
carrion-fowl
carrock
carrots
carrotses
carry
carrying
cart
cart-load
cart-road
carts
cartwrights
carve
carved
carven
carving
cascade
case
cask
casket
casks
cast
cast-off
casting
castle
casts
casual
cat
catapults
cataracts
catch
catches
catching
catering
cats
cattle
caught
cauldron
cause
caused
causeway
causing
caution
cautious
cautiously
cavalcade
cavalry
cave
cave-mouth
cave-troll
cavern
cavernous
caverns
caves
caveyard
cease
ceased
ceaseless
ceaselessly
cedar
cedars
ceded
ceiling
celandine
celebdil
celeborn
celebrant
celebrate
celebrating
celebration
celebrian
celebrimbor
celerdain
cell
cellar
cellars
celos
central
centre
centuries
century
ceorl
ceremony
cerin
certain
certainly
certainty
cesspool
chafed
chafes
chain
chained
chains
chain‚d
chair
chairs
chalcedony
chalk
chalky
challenge
challenged
challenger
challenges
challenging
chamber
chamberlain
chambers
champ
champion
champions
chance
chance-meeting
chanced
chances
change
changeable
changed
changeful
changes
changing
channel
channels
chant
chanted
chanting
chap
chaps
chapter
chapters
character
characters
charcoal
charge
charged
charges
charging
chariots
charm
charmed
charming
charnel-smell
charred
chase
chased
chasing
chasm
chasms
chat
chattels
chatter
chattered
chattering
chatting
cheat
cheated
cheating
cheats
check
checked
checking
cheek
cheek-guards
cheeks
cheer
cheered
cheerful
cheerfully
cheerfulness
cheering
cheerless
cheers
cheery-looking
cheese
cherry
chessboard
chest
chestnut
chestnuts
chests
chetwood
chewing
chief
chiefly
chiefs
chieftain
chieftains
child
childhood
childish
childless
children
childrens
childs
chill
chilled
chilling
chilly
chimney
chimney-corner
chimney-shelf
chimneys
chin
chink
chinks
chins
chip
chips
chisel
chiselled
chiselling
choice
choices
choke
choked
chokes
choking
choose
chooser
chooses
choosing
chopped
chopping
chorus
chose
chosen
chubb
chubbs
chuckled
churned
churning
circle
circled
circles
circlet
circlets
circling
circuit
circular
circulated
circumstances
cirdan
ciril
cirion
cirith
cisterns
citadel
citadel-gate
cities
city
city-gate
citys
civil
clack
clad
claim
claimed
claims
clambered
clambering
clammy
clamorous
clamour
clamouring
clang
clang-bang
clanged
clannish
clans
clap
clapped
clapping
clash
clashed
clashing
clasp
clasped
clasping
clatter
clattered
clattering
claw
clawed
clawfingered
clawing
clawlike
claws
clay
clean
clean-limbed
cleaned
cleaning
clear
clear-cut
clear-voiced
cleared
clearer
clearest
clearing
clearings
clearly
cleave
cleaving
cleft
clefts
clematis
clemency
clenched
clenching
clever
clever-handed
cleverness
click
clicked
cliff
cliff-face
cliff-foot
cliff-like
cliff-top
cliff-wall
cliffs
climb
climbed
climbing
climbs
clime
cling
clinging
clink
clinking
clip-clop
clipped
clippety-clip
clippety-clippely-clip
clipping
cloak
cloaked
cloaks
clock
clocks
clop
clop-clop
close
close-fitting
close-furled
close-serried
close-strung
close-woven
closed
closely
closer
closes
closest
closeted
closeting
closing
cloth
clothed
clothes
clothes-rail
clothing
cloths
cloud
cloud-roof
cloud-veiled
cloud-wall
cloud-wrack
clouded
cloudless
clouds
cloudy
cloudyhead
clove
cloven
club
clubs
clump
clumps
clumsier
clumsily
clumsy
clumsy-limbed
clung
cluster
clustered
clustering
clusters
clutch
clutched
clutches
clutching
clutter
cluttered
coals
coarse
coastlands
coasts
coat
coats
cobwebs
cock
cock-a-whoop
cock-robin
cocking
cockle-boats
cocks
coil
coiled
coiling
coils
coining
cold
cold-gleaming
colder
coldest…
coldly
collapse
collapsed
collar
collect
collected
collecting
collection
collections
collector
colonists
colonized
colony
colour
coloured
colourless
colours
column
columns
comb
combat
combe
combed
combined
combs
come
comely
comer
comers
comes
cometh
comfort
comfortable
comfortably
comforted
comforting
comfortless
comforts
comic
comical
coming
comings
command
commanded
commanding
commands
commend
comment
commentaries
comments
commit
committed
commodious
commodity
common
common-room
commonly
commons
commotion
communicative
communities
companies
companion
companions
companionship
company
comparative
compare
compared
compelling
compensated
compensation
competent
competing
compiled
complain
complaints
complete
completed
completely
complicated
compliment
compliments
composed
compounded
comprehended
comprehending
comprehension
compulsion
computed
comrade
comrades
conceal
concealed
concealing
concealment
conceived
concern
concerned
concerning
concerns
conclave
conclusion
concourse
condemned
condescending
conditions
condor
conduct
cone
cones
coney
coney-snaring
coneys
confederates
confer
confess
confessed
confidence
confidently
confines
confirm
conflicting
confounded
confused
confusing
confusion
congratulate
conical
conin
conjectural
conjuring
conjuror
connected
connexion
connexions
conquer
conquered
conquering
conqueror
conquest
conscience
conscious
consent
consequence
consider
considerable
considered
considering
console
conspiracy
conspirator
conspirators
constant
constantly
constrained
constructed
consult
consulted
consulting
consume
consumed
consuming
contain
contained
containing
contains
content
contented
contention
contents
contest
contested
continually
continue
continued
continues
continuing
continuously
contradictions
contraptions
contrary
contrast
contributor
contrivance
contrive
contrived
contriving
control
convenience
convenient
converged
converging
conversation
converse
convex
convey
conveyed
conveying
convince
convinced
convulsed
convulsion
convulsive
cook
cooked
cooking
cooking-fire
cooking-gear
cooks
cool
cooled
cooler
coomb
coomb-side
copies
copper
coppices
copy
corals
cord
cordial
cords
core
cormacolindor
cormallen
corn
cornel
corner
cornered
corners
cornlands
coronal
corpse-light
corpses
correct
corrected
correction
corrections
correctly
correspondence
corridor
corrupt
corrupted
corrupter
corruption
corrupts
corsairs
corslet
corslets
cost
costs
cosy
cot
cottage
cotton
cottons
couch
couches
coughed
coughing
could
couldnt
council
councils
counsel
counsel-if
counselled
counsellor
counsellors
counsels
count
counted
countenance
counter
counter-spell
countered
counterfeits
counting
countless
countries
countrified
country
country-folk
countrymen
countryside
counts
couple
courage
course
coursed
courses
court
courteous
courteously
courtesies
courtesy
courtly
courts
courtyard
cousin
cousins
cover
covered
covering
coverlet
coverlets
covers
covert
covet
covets
cow
cowed
cower
cowered
cowering
cowing
crack
cracked
cracker
cracker-paper
crackers
cracking
crackle
crackled
cracks
cradles
craft
crafts
craftsmen
crafty
crag
craggy
crags
cram
cramped
craning
crannied
crannies
cranny
crash
crash-crack
crashed
crashing
crater
crave
craven
crawl
crawled
crawling
crazy
creak
creaked
creaking
creakings
cream
creased
creature
creatures
crebain
credible
credit
creek
creep
creepers
creeping
creeps
crept
crescent
cresses
crest
crests
crevice
crevices
crew
cricket
crickhollow
cried
cries
crimson
cringe
cringed
cringing
crippled
crisp
critical
croak
croaked
croaking
crockery
crocks
crook
crook-legged
crooked
crookedly
crop
cross
cross-legged
cross-roads
crossed
crosses
crossing
crossings
crotch
crouch
crouched
crouches
crouching
crow
crow-haunted
crowd
crowded
crowding
crowed
crowing
crown
crowned
crowning
crownless
crowns
crows
cruel
cruelly
cruelty
crumb
crumble
crumbled
crumbles
crumbling
crumbs
crumpled
crumples
crunch
crunchable
crush
crushed
crushing
crust
crusts
cry
crying
crystal
crystals
cudgel
cuio
culled
culvert
cunning
cunningly
cup
cupboard
cupped
cups
cur
curdled
cure
cured
curiosity
curious
curious-minded
curiously
curl
curled
curling
curls
curly
current
currents
curse
cursed
curses
cursing
curtain
curtained
curtains
curunir
curve
curved
curves
curving
cushions
custom
customer
customers
customs
cut
cut-throats
cuts
cutting
cypress
dab
dabbling
dad
daddy
dads
daerons
daffadowndilly
dagger
dagger-hilt
dagorlad
dahrar
daily
dain
dains
dainties
dainty
dais
daisies
dale
dale-men
dales
dam
damage
damaged
damasked
dame
dammed
damned
damp
damper
damrod
dams
dan
dance
dance-tune
danced
dances
dancing
danger
dangerous
dangerous-if
dangerously
dangers
dangle
dangling
dank
dappled
dappling
dare
dared
dares
daresay
daring
dark
dark-eyed
dark-green
dark-grey
dark-haired
dark-leaved
darken
darkened
darkening
darkens
darker
darkest
darkling
darkly
darkness
darksome
darling
darn
daro
dart
darted
darting
darts
dash
dashed
dashing
date
dates
daughter
daughter-in-law
daughters
daunt
daunted
dauntless
daunts
daur
dawdle
dawdling
dawn
dawn-rose
dawned
dawning
day
day-guards
day-heat
daybreak
daylight
daylong
daymeal
days
daytime
dazed
dazzled
dazzling
dazzlingly
dead
deadlier
deadly
deadmens
deafening
deafer
deafest
deagol
deal
dealer
dealing
dealings
deals
dealt
dear
dearer
dearest
dearly
dearth
death
death-knell
deathless
deathlike
deathly
deaths
debatable
debate
debated
debates
debating
debt
decay
decayed
deceit
deceitful
deceits
deceive
deceived
deceived-for
deceives
december
decent
deceptive
decide
decided
decides
deciding
decipher
decision
decisions
deck
declaim
declare
declared
declaring
declining
decrease
deed
deedle-dum-diddle
deeds
deem
deemed
deep
deep-cloven
deep-cut
deep-delved
deep-shadowed
deep-throated
deepen
deepened
deepening
deepens
deeper
deepest
deeping
deeping-coomb
deeping-stream
deeply
deeps
deer
defeat
defeated
defeats
defence
defences
defend
defended
defender
defenders
defending
defiance
defiant
defiantly
defied
defile
defiled
definite
deformity
deft
defy
defying
degree
degrees
dejected
dejectedly
del
delay
delayed
delaying
delays
delete
deliberate
deliberately
delicious
delight
delighted
delightful
delighting
deliver
delivered
deliveries
delivery
dell
dells
delta
deluded
delve
delved
delver
delving
demand
demanded
demanding
demands
demented
den
denethor
denethors
denial
denied
denies
dens
dense
densely
denser
denser-woven
dent
deny
denying
deor
deorwine
depart
departed
departing
departs
departure
dependants
depends
depleted
deploring
depressed
depression
deprived
depth
depths
deputy
derived
derndingle
dernhelm
dernhelms
derry
derufin
dervorin
descend
descendant
descendants
descended
descending
descent
describe
described
descried
description
descry
desert
deserted
deserting
deserve
deserved
deserves
design
designed
designs
desirable
desire
desired
desires
desiring
desolate
desolation
despair
despaired
despairing
despairs
despatched
desperate
desperately
desperation
despise
despite
despoiled
despoiling
despondently
destiny
destroy
destroyed
destroyer
destroyers
destroying
destroys
destruction
detached
detail
details
detect
determined
detested
developed
developing
device
devices
devil
devilry
devils
devious
deviously
devise
devised
devoted
devour
devoured
devouring
dew
dew-drops
dewy
diamond
diamonds
diary
did
didnt
didst
die
died
dies
differ
difference
differences
different
difficult
difficulties
difficulty
diffused
dig
digesting
digging
diggings
dignity
dike
dikes
dillo
dim
dim-lit
dimholt
diminish
diminished
diminishing
dimly
dimmed
dimming
dimness
dimonds
dimrill
din
dine
dinen
diners
ding
dingle
dinguruthos
dining-room
dinner
dinner-party
dinning
dint
dinted
dior
dipped
dipping
dire
direct
directed
directing
direction
directions
directly
dirge
dirty
dirty-looking
disadvantage
disappear
disappearance
disappeared
disappearing
disappears
disappointed
disappointment
disapproval
disaster
disastrous
disbelieved
disc
discern
discomfiting
discomfiture
discomfort
disconcerting
discord
discourse
discourtesy
discover
discovered
discoveries
discovering
discovery
discuss
discussed
discussing
discussion
discussions
disdained
disease
diseased
disfigured
disguise
disguised
disgust
dish
dishes
dishevelled
dishonoured
dishonours
dislike
disliked
dislikes
disliking
dismal
dismay
dismayed
dismiss
dismissed
dismount
dismounted
dismounting
disobeyed
disorder
disordered
disorders
dispel
dispelled
dispirited
display
displayed
displaying
displays
displease
displeased
displeases
displeasure
disposed
disprove
dispute
disquiet
disquieted
disquieting
disquietingly
disregard
disrespect
dissemble
dissipate
dissolved
dissuade
dissuaded
distance
distances
distant
distantly
distaste
distinguish
distorted
distress
distressed
distributed
distribution
district
districts
distrust
distrusted
distrustful
disturb
disturbance
disturbed
disturber
disturbing
disused
ditch
ditches
dithering
dive
dived
divers
dives
divide
divided
divides
dividing
diving
divining
dizziness
dizzy
do
documents
dodged
doer
does
doesnt
dog
dog-like
dogged
doggedly
doggrel
dogs
doing
doings
dol
doled
dolven
domain
dome
domed
domes
dominated
domination
dominion
done
done-to
doner
dong
dont
doom
doom-boom
doomed
door
door-like
door-tree
door-wardens
doors
doorstep
doorward
doorwardens
doorwards
doorway
dora
dori
doriath
dorthonion
dot
dotage
dotard
doth
dots
dotted
double
doubled
doublings
doubly
doubt
doubted
doubtful
doubtfully
doubtless
doubts
doughtiest
doughty
dour-handed
down
downcast
downfall
downfallen
downhearted
downhill
downlands
downright
downs
downstream
downward
downwards
doze
dozed
dozen
dozens
drab
drab-hued
drabbling
drag
dragged
dragging
draggled
dragon
dragon-fire
dragon-hoard
dragon-horn
dragon-lair
dragon-shapes
dragonets
dragons
drainage
drained
drank
draped
dratted
draught
draughts
draw
drawer
draweth
drawing
drawn
draws
dread
dreaded
dreadful
dreadfully
dreading
dream
dream-shadows
dreamed
dreamflower
dreaming
dreamless
dreamlike
dreams
drear
dreary
dregs
drenched
drenching
dress
dressed
drew
dried
drier
driest
drift
drifted
drifting
drifts
driftwood
drink
drink-of
drinking
drinking-bowls
drinking-cup
drinks
drip
dripped
dripping
drive
driven
drivers
drives
driving
driving-seat
drizzle
drogo
drogos
dromunds
drooped
drooping
drop
dropped
dropping
drops
drove
droves
drown
drownd
drownded
drowned
drowning
drowns
drowse
drowsed
drowsily
drowsiness
drowsy
druadan
drum
drum-beat
drum-beats
drumming
drums
drunk
drunken
drunkenly
dry
dry-footed
dry-nurse
dryad
drying
duath
dubious
dubiously
duck
duck-pond
ducked
ducking
due
dug
duilin
duinhir
dull
dull-witted
duller
dulling
dully
dum
dumb
dumbfounded
dumbly
dumbness
dumpling
dun
dun-udan
dunadan
dunadans
dunedain
dung
dungeon
dungeons
dunghill
dunharrow
dunhere
dunland
dunlendings
dunno
durbatuluk
durin
during
durins
durst
durstnt
durthang
dusk
dusk-silver
dusky
dusst
dust
dusty
duties
duty
dwalin
dwarf
dwarf-axe
dwarf-boots
dwarf-candles
dwarf-coat
dwarf-doors
dwarf-fashion
dwarf-gates
dwarf-hoards
dwarf-kingdom
dwarf-kings
dwarf-language
dwarf-lords
dwarf-mail
dwarf-make
dwarf-man
dwarf-runes
dwarf-song
dwarf-tongue
dwarfs
dwarrowdelf
dwarves
dwell
dwell-so
dwellers
dwelleth
dwelling
dwellings
dwells
dwelt
dwimmer-crafty
dwimmerlaik
dwimorberg
dwimordene
dwindle
dwindled
dwindles
dwindling
dyed
dying
dyou
e
each
eager
eagerly
eagerness
eagle
eagle-plume
eagles
ear
earello
earendil
earendils
earlier
earliest
early
earn
earned
earnest
earnestly
earnestness
earnur
ears
earth
earth-colours
earth-gnawing
earth-thunder
earth-wall
earthborn
earthenware
earthier
earthquake
earthward
earthwards
earthy
ease
eased
easier
easiest
easily
east
east-bank
east-borders
east-gate
east-mark
east-mountains
east-shore
east-side
east-way
east-west
eastemnet
easterling
easterlings
easterly
eastern
eastfarthing
eastfold
eastlands
eastward
eastwards
easy
easy-going
eat
eaten
eating
eating-house
eating-you
eats
eaves
eavesdropping
ebb
ebbing
ebony
echo
echoed
echoes
echoing
echor
eclipse
ecthelion
edain
eddying
edge
edged
edges
edgewise
edhellen
edoras
edraith
edro
ee
eel
eerie
effect
effects
efficient
effort
effort-i
efforts
egg
egladil
eglantine
eglerio
eh
eight
eighteen
eighth
eighty
eilenach
either
elaborate
elanor
elbereth
elbow
elbows
eldamar
eldar
elder
elderly
elders
eldest
elected
elements
elen
elenath
elendil
elendils
eleni
elenion
elentari
elessar
eleven
elevenses
eleventh
eleventy-first
eleventy-one
elf
elf-banes
elf-blade
elf-cake
elf-children
elf-cloak
elf-countries
elf-country
elf-eyes
elf-faces
elf-fashion
elf-fountains
elf-friend
elf-friends
elf-hair
elf-havens
elf-horse
elf-kindred
elf-kingdoms
elf-kings
elf-lady
elf-letters
elf-lord
elf-lords
elf-magic
elf-queen
elf-rune
elf-runes
elf-sires
elf-speech
elf-stone
elf-sword
elf-tongue
elf-towers
elf-wardens
elf-warrior
elf-woman
elf-wrights
elf-wrought
elfhelm
elfhelms
elfs
elfstone
elixirs
elladan
ells
elm
elm-woods
elrohir
elrond
elronds
else
elses
elsewhere
elsewhither
eluded
eluding
elusive
elusiveness
elven
elven-blade
elven-blood
elven-boat
elven-bows
elven-brooch
elven-cake
elven-cakes
elven-cloak
elven-cloaks
elven-eyes
elven-fair
elven-fingers
elven-flowers
elven-folk
elven-glass
elven-grey
elven-hoods
elven-kin
elven-king
elven-kings
elven-lady
elven-light
elven-lord
elven-lords
elven-lore
elven-maid
elven-maids
elven-mail
elven-princeling
elven-ring
elven-rings
elven-river
elven-rope
elven-script
elven-sheath
elven-ship
elven-ships
elven-skill
elven-smiths
elven-song
elven-stars
elven-strands
elven-string
elven-sword
elven-tears
elven-tongue
elven-tongues
elven-tower
elven-voices
elven-way
elven-white
elven-wise
elven-work
elvendom
elvenhome
elves
elvish
elwing
elye
em
embalmed
embalmers
embarked
embassies
embassy
embattled
embers
emblem
emblems
embraced
embrasure
embrasures
embroidered
embroiled
emerald
emerge
emergency
emissaries
emissary
employed
emptied
emptiness
empty
emyn
en
enamoured
encamped
enchanted
enchanting
enchantment
encircle
encircled
encircling
enclose
enclosed
enclosing
encompassed
encounter
encourage
encouraged
encouragement
encouraging
encroached
encumber
encumbered
end
endanger
endangered
endeavoured
ended
ending
endings
endless
endlessly
endorenna
ends
endurance
endure
endured
enduring
enemies
enemy
enemys
energetic
enfolding
engaged
engines
engraven
engrossing
engulf
engulfed
enhanced
enhearten
enheartened
enheartening
enjoy
enjoyed
enjoying
enlarged
enlarging
enlighten
enliven
enmity
ennorath
enormous
enough
enquantuva
enquire
enquiry
enrage
enslaved
ensnared
ensuing
ent
ent-draughts
ent-fist
ent-house
ent-houses
ent-strides
ent-voices
entangled
enter
entered
entering
entertainment
entertainments
enthralled
enthroned
enthusiastic
enting
entings
entirely
entish
entmaiden
entmaidens
entmoot
entrails
entrance
entrances
entrapped
entreat
entrust
entry
ents
entwade
entwash
entwife
entwives
entwood
envelope
envied
envinyatar
envy
envying
eomer
eomers
eomund
eomunds
eored
eorl
eorlingas
eothain
eowyn
eowyns
ephel
equal
equally
equipped
equivalent
er
erain
ere
erebor
erech
erect
erected
ered
eregion
erelas
eressea
erestor
eriador
erkenbrand
ernil
errand
errand-rider
errand-riders
errand-runner
errandless
errands
errantry
erred
erring
error
erui
escape
escaped
escapes
escaping
escarpment
escort
escorted
esgalduin
esgaroth
esmeralda
especial
especially
espied
esquire
esquires
essays
essential
established
estates
esteem
estranged
estrangement
estre
et
ethir
etten
ettendales
ettenmoors
evasively
eve
even
even-star
evendim
evening
evening-rest
evening-star
evening-time
evenings
evenstar
event
events
eventually
ever
ever-approaching
ever-changing
ever-darkening
ever-deepening
ever-eve
ever-gathering
ever-mounting
ever-moving
ever-present
ever-widening
everard
everevens
evergreen
evergreens-it
everlasting
evermind
evermore
evernight
everwhite
every
everybody
everybodys
everyone
everyones
everything
everywhere
evicted
evidence
evidently
evil
evil-eyed
evil-looking
evil-smelling
evileyed
evilly
evils
ewer
ewers
exact
exactly
examination
examine
examined
example
excavated
excavation
exceedingly
excellence
excellent
excellently
except
exception
exceptional
exceptionally
exceptions
exchange
exchanged
exchanges
excited
excitement
exciting
exclaim
exclaimed
exclamation
exclamations
excuse
excused
exerted
exerting
exhalation
exhausted
exhaustion
exhibited
exile
exiled
exiles
existence
exit
exits
expanded
expanse
expect
expectancy
expectant
expectation
expected
expecting
expects
expedition
expeditions
expelled
expended
expensive
experience
explain
explained
explaining
explains
explanation
explanations
exploded
explore
explored
explorers
explosion
explosions
exposed
express
expression
extensive
extinguished
extra
extracts
extraordinary
extremely
eye
eye-lids
eye-opener
eye-openers
eye-shaped
eyebrows
eyed
eyeholes
eyeing
eyeless
eyelids
eyes
eyesight
eyot
eyots
eyrie
eyries
f
fa
fabled
fables
fabulously
face
faced
faces
facets
facing
fact
facts
fade
faded
fades
fadeth
fading
fag-end
faggot
faggots
fail
failed
failed-so
failing
fails
fail…
faint
fainted
fainter
faintest
fainthearted
faintly
fair
fair-seeming
fair-spoken
fairbairns
fairer
fairest
fairly
fairs
fairspoken
faith
faithful
faithfully
faithless
fal
fall
fallen
falling
fallohide
fallohides
fallohidish
fallow
falls
falmalinnar
false
falsehood
falter
faltered
faltering
fame
familiar
families
family
family-tree
family-trees
familys
famine
famished
famisshed
famous
famousest
fan-progress
fancied
fancies
fancy
fanfare
fang
fangorn
fangorns
fangs
fanned
fantasies
fantasy
fanuidhol
fanuilos
fanyar
far
far-away
far-off
far-seeing
far-seen
far-sighted
faramir
faramirs
fare
fared
farewell
farewells
faring
farm
farm-buildings
farm-carts
farm-household
farmer
farmers
farmhouse
farmhouses
farms
farmsteads
farseeing
farthing
farthings
fascinated
fashion
fashioned
fast
fast-waning
fasten
fastened
fastening
faster
fastness
fastnesses
fastred
fat
fat-armed
fatal
fate
fated
fates
father
father-in-law
fatherless
fathers
fathom
fathomed
fathomless
fathoms
fatter
fattest
fatty
fattys
fault
faults
favour
favoured
favourite
favourites
fawning
fax
fealty
feanor
fear
feared
fearful
fearfully
fearful…
fearing
fearless
fears
feast
feasted
feasting
feasts
feat
feather
feathered
feathers
featureless
features
fed
feeble
feebly
feed
feeding
feel
feelers
feeling
feels
feet
feigned
feint
felarof
fell
fell-handed
felled
felling
fellow
fellows
fellowship
fells
felt
female
fen
fen-reek
fence
fenced
fences
fencing
fend
fending
fengel
fenmarch
fennas
fenny
fens
fern
fern-brake
ferny
fernys
ferocious
ferries
ferry
ferry-boat
ferthu
fertile
festering
festers
fetch
fetched
fetching
fetters
feud
fever
fevered
few
fewer
fey
fibre
fiddle
fiddle-strings
fiddlesticks
fidgeted
fidgeting
fief
fiefs
field
fields
fierce
fiercely
fierceness
fiercest
fiery
fifteen
fifteenth
fifth
fiftieth
fifty
fifty-one
fifty-second
fight
fight-with
fighter
fighters
fighting
fighting-orc
fights
figure
figure-the
figured
figures
filbert-brakes
file
filed
files
filing
fill
filled
fillet
filling
fills
filtered
filtering
filth
filthy
fimbrethil
final
finally
finch
finches
find
findegil
findegils
finders
finding
finds
finduilas
fine
fine-wrought
finely
finer
finery
finest
finger
finger-bones
finger-nails
fingered
fingering
fingers
fingertips
finglas
finish
finished
finishing
finrod
fir
fir-needles
fir-tree
fir-trees
fir-wood
fir-woods
fire
fire-blasted
fire-bolt
fire-encircled
fire-flecked
fire-light
fire-mountain
fire-pits
fire-place
fire-raising
fire-weed
fire-writing
firebrand
firefoot
fireless
firelight
firelit
fireplace
fires
fireside
fireside-story
fireside-tales
firewood
firework
fireworks
firienfeld
firienwood
firing
firm
firmament
firmer
firmly
firmness
firs
first
first-if
first-rate
firstborn
firth
fish
fished
fisher-folk
fishes
fishing
fishy
fissh
fisshes
fissure
fissures
fist
fists
fit
fitful
fitfully
fitly
fits
fitted
fitting
fittingly
five
five-and-forty
five-stringed
fix
fixed
fixedly
flabbergasted
flabby
fladrif
flag-lilies
flag-stones
flagged
flagging
flagon
flags
flagstone
flake-like
flakes
flame
flamed
flames
flaming
flammifer
flank
flanks
flapped
flapping
flappy
flare
flared
flares
flaring
flash
flashed
flashes
flashing
flask
flat
flat-topped
flatness
flats
flattened
flatter
flattered
flattery
flavour
flaw
flawless
flax-flowers
flaxen-pale
flecked
fled
flee
fleeing
fleet
fleeted
fleeting
fleets
flesh
fleshless
flet
flets
flew
flews
flexed
flick
flicked
flicker
flickered
flickering
flickers
flicking
flies
flight
flights
flinch
flinched
fling
flinging
flint
flinthearted
flitted
flitting
float
floated
floating
floats
flock
flocking
flocks
floi
flood
flood-level
flooded
floods
floor
floors
flotsam
flounder
floundered
flourdumpling
floured
flourishes
flout
flow
flowed
flower
flower-garden
flower-laden
flower-name
flower-spikes
flowered
flowering
flowers
flowery
flowing
flown
flows
fluffy
flung
flurry
flushed
flushing
flute
fluted
flutes
flutter
fluttered
fluttering
fly
flying
foal
foaled
foam
foamed
foaming
fodder
foe
foe-beleaguered
foeman
foes
fog
fog-bound
foggy
fogs
foiled
folca
folco
folcwine
fold
folde
folded
folding
folds
folk
folklands
folkll
folks
follies
follow
followed
followers
following
follows
folly
fond
fondly
food
food-bag
food-bags
food-like
foodless
foods
fool
foolhardy
foolish
foolishly
foolishness
fools
foot
foot-hills
foot-pace
footfall
footfalls
foothills
foothold
footing
footman
footmen
footpad
footpads
footpath
footprints
footsore
footstep
footsteps
footstool
for
foray
forayers
forbade
forbear
forbid
forbidden
forbidding
forbiddingly
forbodes
force
forced
forces
forcing
ford
fording
fords
forebode
foreboded
forebodes
foreboding
forefinger
forefront
forehead
foreheads
foreign
foreigners
foreknowledge
forelegs
foremost
foremother
foresaw
foresee
foreseen
foresight
foresighted
forest
forest-eaves
forest-end
forest-lands
forest-roof
forest-tree
forest-trees
forest-water
forestall
forester
forestry
forests
foretell
foretelling
foretellings
foretold
forever
forfeit
forgave
forge
forge-bellows
forged
forges
forget
forget-me-nots
forgetful
forgetfulness
forgets
forgetting
forging
forgive
forgiven
forgives
forgoil
forgot
forgotten
fork
forked
forks
forlong
forlorn
form
formed
former
formerly
formless
forms
forn
fornost
forsake
forsaken
forsook
forsooth
fort
forth
forthcoming
forties
fortnight
fortnights
fortress
fortresses
forts
fortunate
fortunately
fortune
fortunes
forty
forty-four
forty-second
forty-two
forward
forwards
fosse
fought
foul
foul-smelling
foulbellied
fouled
fouler
found
foundation
foundations
founded
founder
foundered
foundering
fount
fountain
fountains
four
four-footed
four-legged
fours
fourteen
fourteen-twenty
fourteenth
fourth
fowl
fowls
fox
fox-trick
fragment
fragments
fragrance
fragrant
frail
frame
framed
frank
frankness
frantic
frantically
frar
fraught
fray
frayed
frea
frealaf
freawine
fredegar
fredegars
free
freedom
freely
freer
freeze
freezes
frequent
fresh
fresh-cut
freshened
freshener
fresher
freshet
freshness
fret
fretted
fretting
fried
friend
friendless
friendliness
friendly
friends
friendship
friendships
fright
frighten
frightened
frightening
frightful
frightfully
fringe
fringes
frisky
fro
frodo
frodo-lad
frodos
frog
froglike
frogmorton
from
from---
fronds
front
front-door
front-doors
fronted
frontier
frost
frosty
frothed
frothing
frowned
frowning
frowns
froze
frozen
frugal
fruit
fruitful
fruitless
fruits
ft
fuel
fugitives
fulfil
fulfilled
fulfilling
fulfilment
full
full-grown
full-sized
fullness
fully
fulness
fumbled
fumbling
fume
fumed
fumes
fuming
fun
functions
fundin
funeral
fungus-growth
funny
fur
fur-cloaks
furious
furled
furlong
furlongs
furnace
furnaces
furnish
furnished
furniture
furrowed
furry
further
further-unless
furthest
furtive
furtively
fury
future
g
g-rune
g3
gabbled
gable
gaffer
gaffers
gagged
gah
gaily
gain
gained
gaining
gainsaid
gainsaying
gait
galadhon
galadhremmin
galadhrim
galadriel
galadriels
galathilion
galdor
galdors
gale
galen
galenas
gallant
gallantly
galleries
gallop
galloped
gallopers
galloping
galmod
game
games
gamgee
gamgees
gamling
gammers
gandalf
gandalf-and
gandalfs
gang
gangrel
gangrels
gangs
gangway
gangways
gap
gape
gaped
gaping
gar
garb
garbled
garden
garden-lore
garden-path
gardener
gardeners
gardening
gardenings
gardens
garlands
garment
garments
garn
garner
garnets
garrison
garrisoned
garth
garulf
gash
gashed
gasp
gasped
gasping
gasps
gate
gate-arch
gate-breaking
gate-guards
gate-keeper
gate-keepers
gate-like
gate-posts
gate-stream
gatekeeper
gatekeepers
gates
gateway
gather
gathered
gatherers
gathering
gathers
gaunt
gauntlets
gave
gay
gayer
gaze
gazed
gazes
gazing
gear
gebir
geese
gel
gelin
gem
gems
genealogical
genealogies
general
generally
generation
generations
generous
gentle
gentlehobbit
gentleness
gentler
gently
gently-rippling
genuine
genuinely
geography
gerontius
gesture
get
get-up
gets
getting
ghan
ghan-buri-ghan
ghash
ghastly
ghost
ghostly
ghosts
ghylls
giant
giant-wheels
giants
gibbering
gibbet
gibbets
giddy
gift
gifts
gil-galad
gilded
gildor
gildors
gilrain
gilthoniel
gimbatul
gimlets
gimli
gimlis
gingerly
gird
girded
girdle
girt
girth
girths
give
given
giver
gives
giving
glad
gladden
gladdened
gladder
glade
glades
gladly
gladness
glamdring
glance
glanced
glances
glancing
glare
glared
glaring
glass
glazed
gleam
gleamed
gleaming
gleams
gleaned
glede
gleeful
glen
glens
gleowine
gliding
glimmer
glimmered
glimmering
glimpse
glimpsed
glimpses
glint
glinted
glinting
glistened
glistening
glistens
glitter
glittered
glittering
gloaming
gloat
gloated
gloating
globe
gloin
gloins
gloom
gloomed
gloomily
glooms
gloomy
glorfindel
glorfindels
glorious
glory
glossy
gloves
glow
glow-worm
glowed
glowering
glowing
glows
glut
gnarled
gnashing
gnats
gnaw
gnawed
gnawing
gnaws
go
goaded
goal
goat
goatleaf
gobbler
gobbling
goblet
goblin
goblin-barkers
goblin-faces
goblin-men
goblin-soldiers
goblins
god
goes
goest
going
goings
goings-on
golasgil
gold
gold-hung
goldberry
goldberrys
golden
golden-haired
golden-red
goldenhaired
goldilocks
goldwine
gollum
gollum-creature
gollum-like
gollum-manner
gollums
gondolin
gondor
gondors
gone
gong
gongs
good
good-bye
good-day
good-natured
good-nights
goodbodies
goodbody
goodbye
goodly
goodman
goodness
goods
gorbadoc
gorbag
gorbags
gore
gorge
gorging
gorgor
gorgoroth
gorgun
gorhendad
gorse
gorse-bushes
gossamer
gossamer-threads
got
gothmog
govannen
govern
governed
governing
government
gown
grabbed
grabbing
grabbling
grace
graceful
gracious
graciously
gradual
gradually
grain
gram
grand
grand-dad
grandfather
grandfathers
grandmother
grandsire
grandsires
grandson
grange
grant
granted
grants
grappling
grappling-hooks
grasp
grasped
grasping
grass
grass-blades
grass-border
grass-clad
grass-clippings
grass-grown
grass-land
grass-lands
grass-snakes
grass-tussocks
grassclad
grasses
grasshopper
grassland
grassless
grassy
grate
grated
grateful
gratefully
gratified
grating
gratitude
grave
gravel
gravel-shoals
gravely
graven
graver
graves
gravest
graveyard
grazing
greasy
great
great-grandchildren
great-grandfathers
great-grandson
great-great-grandfather
great-hilted
greater
greatest
greatheart
greathearted
greathearts
greatly
greatness
greed
greediest
greedily
greedy
green
green-bordered
green-clad
green-feathered
green-fingered
green-grown
green-hued
green-shadowed
green-sward
green-white
green-yellow
greener
greenfields
greenfooted
greenish
greenleaf
greensward
greenway
greenway-crossing
greenwood
greet
greeted
greeting
greetings
grew
grey
grey-bearded
grey-clad
grey-cloaked
grey-eyed
grey-feathered
grey-green
grey-hooded
grey-hued
grey-skinned
greybeard
greybeards
greycloaked
greyer
greyflood
greyhame
greyness
grief
griefs
grievance
grievances
grieve
grieved
grieves
grieving
grievous
grievously
grim
grim-faced
grima
grimbeorn
grimbold
grimbolds
grime
grimed
grimly
grimmer
grimness
grimslade
grimy
grimy-faced
grin
grind
grinding
grinned
grinning
grins
grip
griping
gripped
gripping
grishnakh
grishnakhs
grist
grit
groan
groaned
groaning
groanings
grond
grooms
grope
groped
gropes
groping
gross
grot
grots
grotto
ground
ground-asleep
groundless
group
groups
grove
grovelled
grovelling
groves
grow
growing
growl
growled
growling
grown
grows
growth
growths
grr
grrr
grub
grubb
grubbs
grudge
grudgingly
gruffly
grumble
grumbling
grunted
guard
guard-house
guard-house--over
guard-towers
guarded
guardian
guardians
guarding
guardroom
guardrooms
guards
guess
guessed
guesses
guessing
guest
guest-house
guesthouse
guests
guests-truly
guidance
guide
guided
guides
guiding
guild
guilty
guise
guises
guldur
gulf
gulfs
gull
gullies
gulls
gully
gum
gums
gunwale
gurgle
gurgled
gurgling
gush
gushed
gushing
gust
gusts
gut
guthlaf
guthwine
guts
guttering
gutters
guttural
gwaihir
h
ha
habergeon
habit
habitable
habitation
habits
hack
hacked
hacking
hacks
had
hadnt
hador
hadst
had…
haft
haggard
haggling
hagling
hai
hail
hailed
hailing
hair
hairs
hairy
hal
halbarad
haldir
haldirs
hale
half
half-asleep
half-bowed
half-burned
half-closed
half-eaten
half-elves
half-empty
half-forgotten
half-grown
half-guessed
half-heeded
half-high
half-humorous
half-knowing
half-light
half-mocking
half-opened
half-orcs
half-past
half-remembered
half-seen
half-shrouded
half-starved
half-strangled
half-stripped
half-trolls
half-veiled
halfast
halfelven
halfings
halfling
halflings
halfway
halifirien
hall
hallo
halloo
hallow
hallowed
hallows
halls
hals
halt
halted
halter
halting
haltingly
halts
halved
halves
ham
hama
hamas
hamfast
hamfasts
hamlet
hamlets
hammer
hammer-stroke
hammered
hammerhand
hammering
hammers
hand
hand-bell
hand-loom
handcarts
handed
handful
handicrafts
handing
handiwork
handkerchief
handkerchiefs
handle
handled
handling
hands
hands-and
hands-first
handsome
handstrokes
handy
hang
hanging
hangings
hangs
hapless
happen
happened
happening
happenings
happens
happier
happily
happiness
happy
happy-ending
harad
haradrim
harboured
harbourless
harbours
hard
hard-edged
hardbottle
harden
hardened
hardening
harder
hardest
hardier
hardiest
hardihood
harding
hardly
hardness
hardy
hare
harfoot
harfoots
hark
harken
harlond
harm
harmed
harmless
harmlessly
harms
harness
harp
harped
harpers
harps
harpstring
harri
harried
harrowdale
harry
harsh
harshly
hart
harts-tongue
harvest
has
hasnt
hast
haste
hasten
hastened
hastening
hastily
hastiness
hasty
hasufel
hat
hatch
hatched
hatches
hatchet
hatching
hate
hated
hateful
hates
hath
hating
hatred
hats
hauberk
haughty
haul
hauled
haunt
haunted
haunting
haunts
have
have-since
haven
havens
havent
having
havoc
haw
hawk
hawks
hawthorn
hay
hay-fork
hayfields
haysend
hayward
haywards
hazard
hazards
haze
hazel
hazel-thickets
hazels
hazes
hazy
he
he---
head
head-down
headaches
headed
headfirst
heading
headless
headlong
headman
headmen
heads
headstall
headway
heal
healed
healer
healers
healing
heals
health
heap
heaped
heaps
hear
heard
hearest
hearing
hearken
hears
heart
heart-quelling
hearten
heartened
heartening
hearth
hearths
hearties
heartily
heartless
hearts
heat
heated
heath
heathen
heather
heather-covered
heathertoes
heathland
heating
heats
heave
heaved
heaven
heavens
heavier
heaviest
heavily
heaviness
heaving
heavy
heavy-armed
heavy-hearted
heavy-legged
heavy-lidded
hed
hedge
hedged
hedgehog
hedgerows
hedges
hee
heed
heeded
heedfully
heeding
heedless
heedlessly
heel
heels
height
heights
heir
heirloom
heirlooms
heirs
held
hell
hell-hawks
hello
helm
helmed
helmet
helmets
helmingas
helms
help
helped
helper
helpers
helpful
helping
helpless
helplessly
helplessness
helps
hem
hemlock-leaves
hemlock-sheaves
hemlock-umbels
hemlocks
hemmed
hemming
hen
hence
henceforth
henceforward
henneth
her
herald
heraldry
heralds
herb
herb-lore
herb-master
herblore
herbs
herd-folk
herded
herdfolk
herds
herdsmen
here
here-which
hereabouts
hereafter
heredity
herefara
heres
hero
herons
hers
herself
herubrand
herugrim
hes
hesitate
hesitated
hesitating
hesitatingly
hesitation
hew
hewed
hewing
hewn
hey
hey-diddle-diddle
hi
hid
hidden
hide
hide-and-seek
hideous
hideously
hides
hiding
hiding-hole
hiding-place
hidings
high
high-arched
high-banked
high-crowned
high-elven
high-hearted
high-road
high-seat
high-seats
higher
highest
highland
highlands
highroad
highway
highway-robber
highways
hildinyar
hill
hill-back
hill-brow
hill-country
hill-pony
hill-side
hill-sides
hill-slope
hill-top
hill-tops
hill-trolls
hillmen
hillock
hills
hillside
hillsides
hilltops
hilly
hilt
hilt-shard
hilts
him
him-and
him-no
him-not
him-they
himself
hind
hinder
hindered
hindering
hindmost
hindrance
hinge
hinges
hint
hinted
hinting
hints
hips
hir
hire
hirgon
hiring
hirluin
hiruva
hiruvalye
his
hisie
hiss
hissed
hisself
hisses
hissing
historical
histories
history
hit
hitch
hither
hitherto
hithlain
hithoel
hits
hive
hm
hmm
ho
hoard
hoarded
hoards
hoarse
hoarsely
hoarwell
hoary
hob
hobbit
hobbit-architecture
hobbit-bows
hobbit-building
hobbit-care
hobbit-child
hobbit-children
hobbit-cloak
hobbit-eyes
hobbit-face
hobbit-families
hobbit-fashion
hobbit-feet
hobbit-folk
